cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/services"
tap "cjbassi/gotop"
tap "golangci/tap"

# Libs and utilities
cask "xquartz"
brew "ack"
brew "coreutils"
brew "imagemagick"
brew "jp2a"
brew "jq"
brew "libcaca"
brew "libgit2"
brew "openssl"
brew "cmake"
brew "htop"
brew "vim"
brew "cjbassi/gotop/gotop"
brew "ffmpeg"
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font" # Nerd Fonts

# Programming languages
brew "node"
brew "go"
brew "pyenv"

# Dev tools
brew "git"
cask "iterm2"
brew "direnv"
brew "cookiecutter"
brew "kubectx"
brew "awscli"
cask "google-cloud-sdk"
brew "postgresql"
brew "hugo"
brew "protobuf"
brew "gpg2"
brew "helm"
brew "httpie"
brew "mkcert"
brew "telnet"
brew "vips"
brew "nvm"
brew "watchman"
brew "yq"
brew "golangci/tap/golangci-lint"
brew "upx"
brew "nmap"
brew "starship"
brew "zsh-syntax-highlighting"
brew "asciinema"
brew "vegeta"
brew "tmux"
tap "shopify/shopify"
brew "shopify/shopify/shopify-cli"
tap "derailed/k9s"
brew "derailed/k9s/k9s"
brew "tilt"
cask "docker"

# Applications
cask "visual-studio-code"
cask "firefox"
cask "google-chrome"
cask "handbrake"
cask "slack"
cask "vlc"
brew "syncthing", restart_service: true
cask "graphql-playground"
brew "restic"
