cask_args appdir: "/Applications"

tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "cjbassi/gotop"
tap "golangci/tap"

# Libs and utilities
cask "xquartz"
brew "ack"
brew "coreutils"
brew "imagemagick"
brew "jp2a"
brew "jq"
brew "libcaca"
brew "libgit2"
brew "openssl"
brew "readline"
brew "unrar"
brew "cmake"
brew "htop"
brew "vim"
brew "cjbassi/gotop/gotop"
cask "osxfuse"
brew "ext4fuse"

# Programming languages
brew "node"
brew "go"
brew "pyenv"

# Dev tools
brew "git"
cask "iterm2"
brew "direnv"
brew "cookiecutter"
brew "kubectx"
brew "awscli"
cask "google-cloud-sdk"
brew "postgresql"
brew "hugo"
brew "protobuf"
brew "gnupg"  # GPG key signing
brew "gpg-agent"  # GPG key signing
brew "pinentry-mac"  # GPG key signing
brew "kubernetes-helm"
brew "httpie"
brew "mkcert"
brew "telnet"
brew "vips"
brew "watchman"
brew "yarn"
brew "yq"
brew "golangci/tap/golangci-lint"
brew "upx"
brew "nmap"

# Applications
cask "visual-studio-code"
cask "firefox"
cask "google-chrome"
cask "handbrake"
cask "slack"
cask "vlc"
brew "syncthing", restart_service: true
cask "graphql-playground"
brew "restic"
