cask_args appdir: "/Applications"

tap "homebrew/science"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "superbrothers/zsh-kubectl-prompt", "git://github.com/superbrothers/zsh-kubectl-prompt.git"
tap "restic/restic"

# Libs and utilities
cask "xquartz"
brew "ack"
brew "coreutils"
brew "imagemagick"
brew "jp2a"
brew "jq"
brew "libcaca", args: ["with-imlib2"]
brew "libgit2"
brew "openssl"
brew "readline"
brew "unrar"
brew "cmake"
brew "htop"
brew "vim"

# Programming languages
brew "node"
brew "nvm"
brew "go"
brew "dep"
brew "pyenv"
brew "python"

# Dev tools
brew "git"
cask "iterm2"
brew "direnv"
brew "cookiecutter"
brew "superbrothers/zsh-kubectl-prompt/zsh-kubectl-prompt"
brew "kube-ps1"
brew "kubectx"
brew "awscli"
cask "google-cloud-sdk"
brew "postgresql"
brew "hugo"
brew "protobuf"
brew "gnupg"  # GPG key signing
brew "gpg-agent"  # GPG key signing
brew "pinentry-mac"  # GPG key signing

# Applications
cask "visual-studio-code"
cask "firefox"
cask "google-chrome"
cask "handbrake"
cask "slack"
cask "vlc"
brew "syncthing", restart_service: true
cask "graphiql"
brew "restic/restic/restic"
